Repository: coco-coc/vproxy
Catalog: lib/l10n/app_*.arb
Languages: ru

# masqueradeQuickDeployDetails
source: Install Xray-core, and deploy Reality/XHTTP inbound. If the server has already installed Xray, the original configuration will be replaced. If the server has not enabled BBR, BBR will be enabled.
ru: Установите Xray-core и разверните входящий трафик Reality/XHTTP. Если на сервере уже установлен Xray, исходная конфигурация будет заменена. Если на сервере не включена поддержка BBR, BBR будет включен.

# fatalError
source: An error occurred. Please restart VX. Error: {error}
ru: Произошла ошибка. Перезапустите VX. Ошибка: {error}

source: Exit
ru: Выход

source: Info
ru: Информация

source: Select at least one selector
ru: Выберите хотя бы один селектор

source: Add Route Mode
ru: Добавить режим маршрута

# setNameProxyApp
source: Proxy
ru: Прокси

# setNameDirectApp
source: Direct
ru: Прямой

# defaultSelectorTag
source: Proxy
ru: Прокси

source: Select at least one node
ru: Выберите хотя бы один узел

# insertDefaultError
source: Failed to insert default data, please restart VX and add them in the routing page. Reason: {error}
ru: Не удалось вставить данные по умолчанию. Перезапустите VX и добавьте их на страницу маршрутизации. Причина: {error}

source: Please select a routing mode
ru: Пожалуйста, выберите режим маршрутизации

# addRouteModeNotice
source: Clicking the + button to add a routing mode.
ru: Нажмите кнопку +, чтобы добавить режим маршрутизации.

# freeUserCannotUseCustomRoutingMode
source: Free users cannot use custom routing modes. Please select a default routing mode. You can add default routing modes in the routing page.
ru: Пользователи бесплатной версии не могут использовать пользовательские режимы маршрутизации. Выберите режим маршрутизации по умолчанию. Вы можете добавить режимы маршрутизации по умолчанию на странице маршрутизации.

# defaultRouteModes
source: Default modes
ru: Режимы по умолчанию

source: Custom
ru: Обычай

# geositeUrlDesc
source: If empty, the geosite.dat provided by LoyalSoldier will be used
ru: Если пусто, будет использоваться geosite.dat, предоставленный LoyalSoldier.

# geoUrlDesc
source: If empty, the geoip.dat provided by LoyalSoldier will be used
ru: Если пусто, будет использоваться geoip.dat, предоставленный LoyalSoldier.

# ruBlocked
source: Russia Blocked
ru: Россия заблокирована

# ruBlockedDesc
source: Domains/IPs blocked in Russia go proxy, others go direct
ru: Заблокированные в России домены/IP-адреса переходят на прокси, остальные — на прямую.

# ruBlockedAll
source: Russia Blocked(All)
ru: Россия заблокирована (все)

# ruBlockedAllDesc
source: All domains/IPs known to be blocked in Russia go proxy, others go direct
ru: Все домены/IP-адреса, заблокированные в России, переходят на прокси, остальные — на прямую.

# dnsServerProxy
source: Proxy DNS Server
ru: Прокси DNS-сервер

# dnsServerDirect
source: Direct DNS Server
ru: Прямой DNS-сервер

# sniffDomainForIpConnection
source: If a connection use IP target, sniff domain
ru: Если соединение использует целевой IP-адрес, прослушивайте домен

# resolveDomain
source: For connections using domain targets, use DNS to resolve IPs. When each resolved IP make the IP condition true, the condition is true
ru: Для подключений с использованием доменных адресов используйте DNS для разрешения IP-адресов. Когда каждый разрешенный IP-адрес делает условие IP-адреса истинным, условие становится истинным.

# skipSniff
source: No Sniff
ru: Нет нюха

# resolve
source: Resovle
ru: Ресовле

# skipResolve
source: No Resolve
ru: Нет решимости

# describeTheProblem
source: Please describe the problem you encountered, if you have already contacted customer service, you can leave it blank
ru: Опишите проблему, с которой вы столкнулись. Если вы уже обращались в службу поддержки клиентов, оставьте поле пустым.

# debugLogNotAvailable
source: Developer log function is not available in non-store version
ru: Функция журнала разработчика недоступна в версии, отличной от магазина.

# useBloomFilter
source: Use Bloom Filter in iOS
ru: Используйте фильтр Блума в iOS

# useBloomFilterDesc
source: Bloom Filter can reduce memory usage, however, there is a small chance (1%) of false positives: domains not in the set might be misclassified as in the set.
ru: Фильтр Блума может сократить использование памяти, однако существует небольшая вероятность (1%) ложных срабатываний: домены, не входящие в набор, могут быть ошибочно классифицированы как входящие в набор.

source: Add from Clash Rule Files
ru: Добавить из файлов правил коллизий

source: Select from Installed Apps
ru: Выбрать из установленных приложений

# ipToDomainDesc
source: IP -> Domain is got from the recent DNS history. Because many domains can have same IP, it can only be said that the connection is likely to have the domain, but not guaranteed.
ru: Связь IP -> Домен берётся из недавней истории DNS. Поскольку многие домены могут быть преобразованы в один и тот же IP-адрес, это может быть не настоящий домен. Поэтому соединение, скорее всего, будет содержать домен, но это не гарантируется.

# followingAiTranslated
source: The following languages are translated by AI, which may not be accurate.
ru: Перевод на следующие языки осуществляется с помощью искусственного интеллекта, поэтому он может быть неточным.

source: Add to Default
ru: Добавить в группу по умолчанию

source: days
ru: дней

source: hours
ru: часов

source: minutes
ru: минут

source: seconds
ru: секунд

source: Uptime
ru: Время работы

source: Outbound
ru: Выход

source: Overview
ru: Обзор

source: VX Core Config
ru: Конфигурация VX Core
