Repository: coco-coc/vproxy
Catalog: lib/l10n/app_*.arb
Languages: ru

# ruleNameProxyApp
source: Proxy App
ru: Прокси-приложение

# ruleNameDirectApp
source: Direct App
ru: Прямое приложение

# ruleNameCnDirectIp
source: CN Mode Direct IPs
ru: Прямые IP-адреса режима CN

# ruleNameDefaultProxy
source: Default Proxy
ru: Прокси по умолчанию

# ruleNameCnDirectDomain
source: CN Mode Direct Domains
ru: Прямые домены режима CN

# ruleNameGfwProxyDomain
source: GFW Mode Proxy Domains
ru: Прокси-домены режима GFW

# ruleNameGfwProxyIp
source: GFW Mode Proxy IPs
ru: IP-адреса прокси-сервера режима GFW

# ruleNameRuBlockProxyDomain
source: RU-Block Mode Proxy Domains
ru: Прокси-домены в режиме RU-Block

# ruleNameRuBlockProxyIp
source: RU-Block Mode Proxy IPs
ru: IP-адреса прокси-серверов в режиме RU-Block

# ruleNameRuBlockAllProxyDomain
source: RU-Block(All) Mode Proxy Domains
ru: Прокси-домены в режиме RU-Block(All)

# ruleNameRuBlockAllProxyIp
source: RU-Block(All) Mode Proxy IPs
ru: IP-адреса прокси-серверов в режиме RU-Block(All)

# ruleNameDefaultDirect
source: Default Direct
ru: По умолчанию Прямой

# ruleNameGlobalDirectDomain
source: Proxy-All Mode Direct Domains
ru: Прямые домены в режиме Proxy-All

# ruleNameGlobalDirectIp
source: Proxy-All Mode Direct IPs
ru: Прямые IP-адреса в режиме Proxy-All

source: Add App Set
ru: Добавить набор приложений

# pro
source: Lifetime Pro Account
ru: Пожизненная учетная запись Pro

source: Proxy Share
ru: Поделиться прокси

source: Sniff
ru: Нюхать

# proxyShareDesc
source: Enable HTTP and SOCKS inbound after VPN starts, so that other devices in the local network can access the internet through this machine. The inbound name is "proxyShare", which you can use in rules.
ru: Включите входящие HTTP и SOCKS после запуска VPN, чтобы другие устройства в локальной сети могли подключаться к интернету через этот компьютер. Имя входящего трафика — «proxyShare», его можно использовать в правилах.

source: Login Success
ru: Успешный вход

# emailLogin
source: Login by Email
ru: Войти по электронной почте

source: Apple
ru: Яблоко

source: Microsoft
ru: Майкрософт

# rateApp
source: Rate VX
ru: Оценить VX

# userConsend
source: Once you login, your email will be stored in our server until you delete your account. This is neccessary for providing account login. We do not share your email with any third party. Do you allow us to store your email?
ru: После входа в систему ваш адрес электронной почты будет храниться на нашем сервере до тех пор, пока вы не удалите свою учётную запись. Это необходимо для обеспечения возможности входа в учётную запись. Мы не передаем ваш адрес электронной почты третьим лицам. Разрешаете ли вы нам хранить ваш адрес электронной почты?

source: Okay
ru: Хорошо

source: Disagree
ru: Не согласен

source: Reject
ru: Отклонять

# greatSetDescription1
source: A large set is composed of small sets or other large sets. When telling whether a domain/IP is in the set, the exluded sets will be considered first, if the domain is in any of the excluded set, then the domain is not in the set.
ru: Большой набор состоит из небольших наборов или других больших наборов. При определении принадлежности домена/IP-адреса к набору в первую очередь рассматриваются исключенные наборы. Если домен входит в какой-либо из исключенных наборов, то он отсутствует в наборе.

# greatSetDescription2
source: A large set can have a mutually exclusive set. If a domain/IP is in set A, then the domain/IP is not in it's mutually exclusive set.
ru: В большом наборе может быть взаимоисключающий набор. Если домен/IP-адрес входит в набор A, то этот домен/IP-адрес не входит в свой взаимоисключающий набор.

source: Please login first
ru: Пожалуйста, сначала войдите в систему

source: Telegram
ru: Телеграмма

# failedToDownloadGeoData
source: Failed to download GeoData: {value}
ru: Не удалось загрузить GeoData: {value}

# doNotUse1080IOS
source: Do not use 1080 on iOS
ru: Не используйте 1080 на iOS

source: Deleted Node
ru: Удаленный узел

# selectorContainsDeletedLandHandler
source: Selector {value} uses a deleted node as landing node, please remove it and retry
ru: Селектор {value} использует удаленный узел в качестве целевого узла, пожалуйста, удалите его и повторите попытку.

# tunIpv6Settings
source: TUN IP Settings
ru: Настройки IP TUN

source: Always Enable IPv6
ru: Всегда включать IPv6

# dependsOnDefaultNic
source: Depends on Default Physical NIC
ru: Зависит от физической сетевой карты по умолчанию

# dependsOnDefaultNicDesc
source: If the default physical NIC supports IPv6, then the TUN NIC will also support IPv6, otherwise IPv6 is not supported
ru: Если физическая сетевая карта по умолчанию поддерживает IPv6, то сетевая карта TUN также будет поддерживать IPv6, в противном случае IPv6 не поддерживается.

# failedToCreateAllFirstLaunch
source: Failed to create database tables: {value}
ru: Не удалось создать таблицы базы данных: {value}

# failedToInsertDefaultData
source: Failed to insert default data into database: {value}
ru: Не удалось вставить данные по умолчанию в базу данных: {value}

# newVersionDownloadedDialog
source: New version {version} downloaded, install it?
ru: Новая версия {version} загружена, установить ее?

source: Skip this version
ru: Пропустить эту версию

source: Install
ru: Установить

# later
source: Remind Me Later
ru: Напомнить мне позже

# autoUpdateDescription
source: Automatically downloading new version and notify you when it's ready
ru: Автоматически загружает новую версию и уведомляет вас, когда она будет готова

# downloading
source: Downloading {version}...
ru: Загрузка {version}...

# installFailed
source: Failed to install update, reason: {reason}
ru: Не удалось установить обновление, причина: {reason}

# tun46SettingIpv4Only
source: IPv4 Only
ru: Только IPv4

# tun46SettingIpv4AndIpv6
source: IPv4 and IPv6
ru: IPv4 и IPv6

# ad
source: Ads
ru: Реклама

# advancedSettingDesc
source: VPN related settings
ru: Настройки, связанные с VPN

source: General
ru: Общий

source: Light
ru: Свет

source: Dark
ru: Темный

source: System
ru: Система

# themeMode
source: Theme
ru: Тема

source: Server Error
ru: Ошибка сервера

# gfwDesc
source: All domains/IPs that are blocked by GFW go proxy, others go direct
ru: Все домены/IP-адреса, заблокированные GFW, подключаются через прокси, остальные — напрямую.

# cnDesc
source: All domains/IPs of China mainland go direct, others go proxy
ru: Все домены/IP-адреса материкового Китая переходят на прямой доступ, остальные — на прокси-сервер.

# proxyAllDesc
source: All non-private domains/IPs go proxy
ru: Все нечастные домены/IP-адреса переходят на прокси-сервер

# dnsRule
source: DNS Rules
ru: Правила DNS

# dnsRuleNameGfwProxyFake
source: GFW Mode Proxy Domains(A/AAAA)
ru: Прокси-домены режима GFW (A/AAAA)

# dnsRuleNameGfwProxy
source: GFW Mode Proxy Domains
ru: Прокси-домены режима GFW

# dnsRuleNameRuBlockProxyFake
source: RU-Block Mode Proxy Domains(A/AAAA)
ru: Прокси-домены в режиме RU-Block (A/AAAA)

# dnsRuleNameRuBlockProxy
source: RU-Block Mode Proxy Domains
ru: Прокси-домены в режиме RU-Block

# dnsRuleNameRuBlockAllProxyFake
source: RU-Block(All) Mode Proxy Domains(A/AAAA)
ru: Прокси-домены режима RU-Block(All) (A/AAAA)

# dnsRuleNameRuBlockAllProxy
source: RU-Block(All) Mode Proxy Domains
ru: Прокси-домены в режиме RU-Block(All)

# dnsRuleNameCnProxyFake
source: CN Mode Proxy Domains(A/AAAA)
ru: Прокси-домены режима CN (A/AAAA)

# dnsRuleNameCnProxy
source: CN Mode Proxy Domains
ru: Прокси-домены режима CN

# dnsRuleNameProxyAllProxyFake
source: Proxy-All Mode Proxy Domains(A/AAAA)
ru: Прокси-домены в режиме Proxy-All (A/AAAA)

# dnsRuleNameProxyAllProxy
source: Proxy-All Mode Proxy Domains
ru: Прокси-домены в режиме Proxy-All

# dnsRuleNameDefaultDirect
source: Others
ru: Другие

source: Router Rules
ru: Правила маршрутизатора

# dnsRuleDesc
source: For each DNS request, rules are matched one by one starting from the top. If a rule matches, the following rule will not be considered. The dns server specified by the rule will be used to handle the dns query
ru: Для каждого DNS-запроса правила сопоставляются по одному, начиная с самого верха. Если правило совпало, следующее правило не учитывается. DNS-сервер, указанный в правиле, будет использоваться для обработки DNS-запроса.

source: DNS Server
ru: DNS-сервер

# howDnsRuleMatch
source: When all conditions match or there is no condition enabled, a dns rule matches.
ru: Если все условия совпадают или ни одно условие не включено, правило DNS срабатывает.

source: Select at least one dns server
ru: Выберите хотя бы один DNS-сервер

source: DNS Type
ru: Тип DNS

source: Direct DNS Server
ru: Прямой DNS-сервер

source: Proxy DNS Server
ru: Прокси DNS-сервер

source: Add DNS Server
ru: Добавить DNS-сервер

# useDefaultDnsServer
source: Use DNS servers of default NIC. If unable to get the servers, fallback to use the above servers.
ru: Используйте DNS-серверы сетевой карты по умолчанию. Если не удаётся получить доступ к серверам, используйте указанные выше серверы.

# useDefaultNicDnsServer
source: Use DNS servers of default NIC. If unable to get the servers, use the following:
ru: Используйте DNS-серверы сетевой карты по умолчанию. Если не удаётся получить доступ к серверам, используйте следующее:

# addDnsAddressHint
source: Multiple addresses supported. Use comma to seperate. Each dns query will be sent to all addresses simultaneouly, the first reply will be used.
ru: Поддерживается несколько адресов. Разделяйте их запятыми. Каждый DNS-запрос будет отправлен на все адреса одновременно, будет использован первый ответ.

source: Invalid URL
ru: Неверный URL-адрес

source: Duplicate DNS server name
ru: Дублирующееся имя DNS-сервера

# dnsTypeConditionDesc
source: If checked, then this condition is enabled. The condition is true only when the type of a dns query is in the selected type.
ru: Если флажок установлен, это условие включено. Условие выполняется только в том случае, если тип DNS-запроса соответствует выбранному типу.

# enabledConditions
source: Enabled conditions: {number}
ru: Включенные условия: {number}

source: Show Selector
ru: Показать селектор

source: Hide Selector
ru: Скрыть селектор

source: Show Handler
ru: Показать обработчик

# hideHandler
source: Hide Selector
ru: Скрыть селектор

# restoreIAP
source: Restore Purchase
ru: Восстановить покупку

source: Debug Log
ru: Журнал отладки

source: Upload
ru: Загрузить

# saveToDownloadFolder
source: Save to Download
ru: Сохранить для загрузки

# saveToDownloadFolderDesc
source: Move the logs to your Download folder
ru: Переместите журналы в папку «Загрузки».

# debugLogDesc
source: If you encountered any problem during using VX, you can enable the button, and wait until the problem occur again, then click upload to upload the logs to us, rememeber to close it and delete the logsafter uploading. Developer logs are not uploaded automatically since they contain your network activities, including the websites and apps you use. We delete the logs immediately once we process them.
ru: Если у вас возникли проблемы при использовании VX, вы можете включить кнопку и дождаться повторного возникновения проблемы, затем нажать кнопку «Загрузить», чтобы загрузить логи. Не забудьте закрыть её и удалить логи после загрузки. Журналы разработчика не загружаются автоматически, поскольку содержат информацию о вашей сетевой активности, включая используемые вами веб-сайты и приложения. Мы удаляем логи сразу после их обработки.

# clashFormatSupported
source: Only Clash Rule files are supported
ru: Поддерживаются только файлы правил коллизий.

source: Network
ru: Сеть

source: Source
ru: Источник

source: Fallback To Proxy
ru: Возврат к прокси-серверу

# fallbackToProxySetting
source: When a direct connection failed, fallback to use proxy. The node selected by the "Proxy" selector will be used, if the selector does not exist, a random nodes will be selected
ru: При сбое прямого соединения используется резервный прокси-сервер. Будет использован узел, выбранный селектором «Прокси». Если селектор не существует, будет выбран случайный узел.

# installAsWinService
source: Add VX to Windows Service
ru: Добавить VX в службу Windows

# installAsWinServiceDesc
source: Before use TUN, VX needs to be added into Windows Service. Click Yes to install VX as a service, which would require you to give permission in the following UAC prompt window.
ru: Перед использованием TUN необходимо добавить VX в службу Windows. Нажмите «Да», чтобы установить VX как службу. Для этого потребуется дать разрешение в следующем окне запроса UAC.

# placeOnTop
source: Top
ru: Вершина

# fallbackTo
source: Fallback to {node}
ru: Возврат к {node}

# pingTestMethod
source: Latency Test Method
ru: Метод проверки задержки

# pingReal
source: Real Latency
ru: Реальная задержка

# pingRealDesc
source: Time used to retrieve a result
ru: Время, затраченное на получение результата

source: Start on Boot
ru: Запуск при загрузке

# startOnBootDesc
source: Start VX automatically at startup
ru: Запускать VX автоматически при запуске

source: Always ON
ru: Всегда включен

# alwaysOnDesc
source: As long as you did not click disconnect, always try to be connected when the app is running
ru: Пока вы не нажали кнопку «Отключить», всегда старайтесь оставаться подключенным, когда приложение запущено.

source: Check and Update
ru: Проверить и обновить

# noNewVersion
source: No new versions
ru: Нет новых версий

# enableSystemExtension
source: Please enable VX SystemExtension by going to System Settings -> General -> Login Items & Extensions -> Network Extensions
ru: Включите VX SystemExtension, перейдя в Системные настройки -> Общие -> Элементы входа и расширения -> Сетевые расширения.

source: System Proxy Port Setting
ru: Настройка порта системного прокси-сервера

source: Random Ports
ru: Случайные порты

source: Static Ports
ru: Статические порты

# whenNoDomain
source: Sniff When No Domain Info
ru: Снифф, когда нет информации о домене

source: Enable
ru: Давать возможность

source: Disable
ru: Запрещать

source: Check Update
ru: Проверить обновление

# handlerCopiedSuccess
source: Copy succeeded. The node has been added to the Default group
ru: Копирование выполнено успешно. Узел добавлен в группу по умолчанию.

source: Hysteria Reject QUIC
ru: Истерия отвергает QUIC

source: Sync & Backup
ru: Синхронизация и резервное копирование

source: Cloud Sync
ru: Облачная синхронизация

# cloudSyncDesc1
source: Sync your database between multiple devices.
ru: Синхронизируйте базу данных между несколькими устройствами.

# cloudSyncDesc2
source: For Android devices with Google Services installed and Apple devices that can communicate with Google FCM servers, sync are real-time. Otherwise, sync will happen every 5 minutes.
ru: Для устройств Android с установленными сервисами Google и устройств Apple, которые могут взаимодействовать с серверами Google FCM, синхронизация выполняется в режиме реального времени. В противном случае синхронизация будет происходить каждые 5 минут.

# cloudSyncDesc3
source: The sync data will be automatically cleared from the cloud after your device have fetched them. If your device has not fetched them for 7 days, the data will deleted from the cloud.
ru: Данные синхронизации будут автоматически удалены из облака после того, как ваше устройство их скачает. Если ваше устройство не скачает их в течение 7 дней, данные будут удалены из облака.

# nodeSub
source: Node/Subscription
ru: Узел/Подписка

# routeSetDNSSelector
source: Rule/Set/Selector/DNS
ru: Правило/Набор/Селектор/DNS

# selectorSetting
source: Selector Settings
ru: Настройки селектора

source: Server/Key
ru: Сервер/Ключ

source: LAN Sync
ru: Синхронизация по локальной сети

source: Sync
ru: Синхронизация

# conditaionWarn1
source: In most cases, domain conditions and IP conditions should not exist at the same time. When they both exist, the rule will only match when the request has both domain and IP information, which is not always the case.
ru: В большинстве случаев условия домена и условия IP-адреса не должны существовать одновременно. Если они присутствуют одновременно, правило сработает только в том случае, если запрос содержит информацию как о домене, так и об IP-адресе, что случается не всегда.

source: Set Name
ru: Установить имя

source: Add Set
ru: Добавить набор

# domainIpAppConditionDesc
source: When a request's domain/IP/App is in any of the sets, the rule matches.
ru: Если домен/IP-адрес/приложение запроса входит в любой из наборов, правило срабатывает.

# backup
source: Database Backup
ru: Резервное копирование базы данных

source: Auto Backup
ru: Автоматическое резервное копирование

# autoBackupDesc
source: Automatically backup database to cloud once a day.
ru: Автоматически выполнять резервное копирование базы данных в облако один раз в день.

source: Current Backup
ru: Текущая резервная копия

# uploadDb
source: Upload
ru: Загрузить

# restoreDb
source: Restore
ru: Восстановить

# deleteCloudDb
source: Delete database in cloud
ru: Удалить базу данных в облаке

# uploadDbSuccess
source: Upload database successfully
ru: База данных успешно загружена

# restoreDbSuccess
source: Restore database successfully
ru: Восстановление базы данных успешно завершено

# deleteDbSuccess
source: Delete successfully
ru: Удалить успешно

source: Grid View
ru: Вид сетки

source: List View
ru: Вид списка

source: Sort
ru: Сортировать

source: Clear
ru: Прозрачный

# fallbackRetryDomain
source: Retry Domain
ru: Повторить домен

# fallbackRetryDomainDesc
source: If a proxy connection uses ip targets and failed due to i/o timeout(this might due to DNS pollution), use domain as target and retry. The sniffed domain of the connection will be used first, if it is unavailable, the ip-to-domain domain will be used.
ru: Если прокси-подключение использует IP-адреса и не удалось подключиться из-за тайм-аута ввода-вывода (например, из-за загрязнения DNS), используйте домен в качестве целевого и повторите попытку. Сначала будет использован домен, полученный с помощью сниффинга, а если он недоступен, будет использован домен IP-to-domain.

# backupPasswordDesc
source: Used to encrypt database. Only devices with this password can restore backups. The password is encrypted and stored locally.
ru: Используется для шифрования базы данных. Восстановление резервных копий возможно только с устройств с этим паролем. Пароль зашифрован и хранится локально.

# syncPasswordDesc
source: Used to encrypt sync data. Only devices with this password can sync data successfully. The password is encrypted and stored locally.
ru: Используется для шифрования данных синхронизации. Только устройства с этим паролем могут успешно синхронизировать данные. Пароль шифруется и хранится локально.

# addDomainIpAppSet
source: Add Domain/App/IP Set
ru: Добавить набор доменов/приложений/IP-адресов

source: Unsaved
ru: Несохраненный

# rememberPasswordInMemory
source: Remember sudo password in memory for later use
ru: Запомните пароль sudo для дальнейшего использования.

source: Do not show again
ru: Не показывать снова

# rpmTunNotice
source: When TUN is on, Reverse Path Forwarding mode will be set to Loose(2) and reset to what it was when disconnect. You can go to the following website to learn about Reverse Path Forwarding
ru: При включении TUN режим переадресации по обратному пути устанавливается на значение Loose(2) и возвращается к состоянию, которое было при отключении. Подробнее о переадресации по обратному пути можно узнать на следующем веб-сайте.

# internalDnsDesc
source: Internal DNS servers are used to resolve domains when outbounds are dialing. There are two of them, one is internal-dns-proxy, which uses the Proxy selector to connect to 1.1.1.1; the other is internal-dns-direct, which uses directly connect to 223.5.5.5 and 1.1.1.1. The internal-dns-direct is used first, if it failed, the internal-dns-proxy will be used.
ru: Внутренние DNS-серверы используются для разрешения доменов при исходящих звонках. Их два: один — internal-dns-proxy, который использует селектор прокси для подключения к 1.1.1.1; другой — internal-dns-direct, который использует прямое подключение к 223.5.5.5 и 1.1.1.1. Первым используется internal-dns-direct, а в случае неудачи — internal-dns-proxy.

# nodeSetDesc
source: There is a small domain set named "__node__" which contains domains and SNIs of all nodes. There is also a small IP set named "__node__" which contains IPs of all nodes.
ru: Существует небольшой набор доменов под названием «__node__», содержащий домены и SNI всех узлов. Также существует небольшой набор IP-адресов под названием «__node__», содержащий IP-адреса всех узлов.

# dnsNameDesc
source: A DNS server's name can be referenced in the inbound condition to specify which node it uses.
ru: Имя DNS-сервера можно указать во входящем условии, чтобы указать, какой узел он использует.

# directAppSetDesc
source: On Android, applications in the direct app set will not go through VX (Split Tunnel)
ru: На Android приложения из набора прямых приложений не будут проходить через VX (разделенный туннель)

source: Delete Debug Logs
ru: Удалить журналы отладки

# conditionDesc
source: When a connection does not have IP info, IP condition will be false and the rule will not match. Similarly, when a connection does not have domain info, domain condition will be false and the rule will not match.
ru: Если у соединения нет информации об IP-адресе, условие IP-адреса будет ложным, и правило не сработает. Аналогично, если у соединения нет информации о домене, условие домена будет ложным, и правило не сработает.

source: Lookup ECH
ru: Поиск ECH

# lookupEchDesc
source: If enabled and above ECH Config is empty, ECH config will be looked up from DNS server. If lookup success, use ECH, otherwise do not use ECH.
ru: Если включено и указанная выше конфигурация ECH пуста, конфигурация ECH будет найдена на DNS-сервере. Если поиск успешен, использовать ECH, в противном случае не использовать ECH.

# adWanted
source: Publish Ads
ru: Опубликовать рекламу

# basicQuickDeployTitle
source: Two cores, four protocols
ru: Два ядра, четыре протокола

# basicQuickDeploySummary
source: Deploy Xray, Hysteria cores and set nodes with four common protocols
ru: Развертывание ядер Xray, Hysteria и настройка узлов с четырьмя распространенными протоколами

# basicQuickDeployDetails
source: Install Xray-core and Hysteria, and deploy the following four inbound. If the server has already installed Xray or Hysteria, the original configuration will be replaced. If the server has not enabled BBR, BBR will be enabled.
ru: Установите Xray-core и Hysteria, а также разверните следующие четыре входящих сервера. Если на сервере уже установлены Xray или Hysteria, исходная конфигурация будет заменена. Если на сервере не включена поддержка BBR, BBR будет включен.

# basicQuickDeployContent1
source: Vmess five random ports
ru: Vmess пять случайных портов

# basicQuickDeployContent2
source: Shadowsocks five random ports
ru: Shadowsocks пять случайных портов

# basicQuickDeployContent3
source: Hysteria 443 port
ru: Порт Hysteria 443

# basicQuickDeployContent4
source: Vless-XTLS-Vision 443 port
ru: Порт Vless-XTLS-Vision 443

# masqueradeQuickDeployTitle
source: Reality/XHTTP
ru: Реальность/XHTTP

# masqueradeQuickDeploySummary
source: Install Xray-core and deploy Reality/XHTTP inbound. If the server has already installed Xray, the original configuration will be replaced. If the server has not enabled BBR, BBR will be enabled.
ru: Установите Xray-core и разверните входящий трафик Reality/XHTTP. Если на сервере уже установлен Xray, исходная конфигурация будет заменена. Если на сервере не включена поддержка BBR, BBR будет включен.
