Repository: coco-coc/vproxy
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Node
ru: Узел

source: Inbound
ru: Входящий

source: Start
ru: Начинать

source: Log
ru: Бревно

source: Log Level
ru: Уровень журнала

source: Settings
ru: Настройки

source: About
ru: О

source: Version
ru: Версия

source: Routing
ru: Маршрутизация

source: GFW
ru: ГФВ

source: Proxy All
ru: Прокси Все

source: Auto
ru: Авто

source: System Proxy
ru: Системный прокси

source: Input Manually
ru: Ввод вручную

source: QR Code
ru: QR-код

source: Add Node
ru: Добавить узел

source: Photo
ru: Фото

source: Clipboard
ru: Буфер обмена

source: Protocol
ru: Протокол

source: Add
ru: Добавлять

source: Name
ru: Имя

source: Domain Strategy
ru: Стратегия домена

source: Enable Mux
ru: Включить мультиплексор

source: Address
ru: Адрес

# ipOrDomain
source: IP / Domain
ru: IP-адрес/домен

source: Port
ru: Порт

source: Node Selection
ru: Выбор узла

source: Server
ru: Сервер

source: Compass
ru: Компас

source: Home
ru: Дом

source: Connecting
ru: Подключение

source: Connected
ru: Подключен

source: Disconnecting
ru: Отключение

source: Disconnected
ru: Отключен

source: Subscription
ru: Подписка

source: Unknown
ru: Неизвестный

source: Preparing
ru: Подготовка

source: Edit
ru: Редактировать

source: Speed Test
ru: Тест скорости

# statusTest
source: Usable Test
ru: Тест пригодности к использованию

source: Selfhost
ru: Селфхостинг

source: Free
ru: Бесплатно

source: Reconnecting
ru: Повторное подключение

source: Cancel
ru: Отмена

source: Save
ru: Сохранять

source: Password
ru: Пароль

source: Account Name
ru: Имя учетной записи

source: Delete
ru: Удалить

source: Getting Nodes/Subscriptions
ru: Получение узлов/подписок

source: Empty clipboard
ru: Пустой буфер обмена

# decodeQrCode
source: Failed to decode QR code
ru: Не удалось декодировать QR-код

source: Proxy
ru: Прокси

source: Direct
ru: Прямой

# promote
source: Promotion
ru: Повышение

# domainsOrIps
source: Domains/IPs
ru: Домены/IP-адреса

source: Add Proxy Domain/IP
ru: Добавить прокси-домен/IP

source: Add Direct Domain/IP
ru: Добавить прямой домен/IP

source: Domain
ru: Домен

source: Type
ru: Тип

source: Invalid IP
ru: Неверный IP-адрес

source: Invalid CIDR
ru: Неверный CIDR

source: Exact
ru: Точный

source: Regular Expression
ru: Регулярное выражение

source: Keyword
ru: Ключевое слово

source: Root Domain
ru: Корневой домен

source: Add Server
ru: Добавить сервер

source: Edit Server
ru: Редактировать сервер

source: SSH Key
ru: SSH-ключ

source: Select From File
ru: Выбрать из файла

source: Sudo Password
ru: Пароль Sudo

source: Status Monitor
ru: Монитор состояния

source: Field Required
ru: Обязательное поле

source: Invalid Port
ru: Неверный порт

source: Invalid Address
ru: Неверный адрес

source: Failed to add server
ru: Не удалось добавить сервер

source: Memory
ru: Память

source: Storage
ru: Хранилище

# serverPubKey
source: Server Public Key
ru: Открытый ключ сервера

# serverPubKeyHelper
source: If not filled, any public key sent by the server on the first connection will be accepted, then the public key will be used on the future connections.
ru: Если поле не заполнено, будет принят любой открытый ключ, отправленный сервером при первом подключении, затем открытый ключ будет использоваться при последующих подключениях.

# failedConnectServer
source: Failed to connect
ru: Не удалось подключиться

source: Retry
ru: Повторить попытку

source: Key Passphrase
ru: Ключевая фраза-пароль

source: Show Realtime Status
ru: Показать статус в реальном времени

source: Hide Realtime Status
ru: Скрыть статус в реальном времени

source: App
ru: Приложение

source: App Name
ru: Название приложения

source: Prefix
ru: Префикс

source: Confirm
ru: Подтверждать

source: Add to Proxy?
ru: Добавить в прокси?

source: Add to Direct?
ru: Добавить в Direct?

# default0
source: Default
ru: По умолчанию

source: Website
ru: Веб-сайт

source: End Time
ru: Конец Времени

source: Remaining Data
ru: Оставшиеся данные

source: Update
ru: Обновлять

source: Actions
ru: Действия

source: Update Interval
ru: Интервал обновления

source: Test Area
ru: Тестовая зона

source: Auto Update
ru: Автоматическое обновление

# unableToGetNodes
source: Failed to get nodes, your pasteboard does not contain a subscription url that VX can parse
ru: Не удалось получить узлы, ваш буфер обмена не содержит URL-адрес подписки, который VX может проанализировать.

# unableToGetNodesEmptyClipboard
source: Failed to get nodes, clipboard is empty
ru: Не удалось получить узлы, буфер обмена пуст

source: Subscription Address
ru: Адрес подписки

source: Empty
ru: Пустой

# invalidHttp
source: Invalid HTTPS URL
ru: Неверный URL-адрес HTTPS

source: No Node
ru: Нет узла

source: Failed to change outbound mode
ru: Не удалось изменить исходящий режим

source: Failed to change fake dns
ru: Не удалось изменить поддельный DNS

source: Failed to change routing mode
ru: Не удалось изменить режим маршрутизации.

# disableInAuto
source: Disable in auto mode
ru: Отключить в автоматическом режиме

source: Area
ru: Область

source: Remark
ru: Замечание

source: Remark & Address
ru: Замечание и адрес

source: Usable
ru: Годен к использованию

source: Speed
ru: Скорость

source: Latency
ru: Задержка

# selectOneOutbound
source: Select
ru: Выбирать

# addFailedUniqueConstraint
source: Addition failed because the rule confilcts with an existing rule.
ru: Добавление не удалось, так как правило противоречит существующему правилу.

# enableInAuto
source: Enable in auto mode
ru: Включить в автоматическом режиме

source: Show Client
ru: Показать клиента

source: Connect
ru: Соединять

source: Disconnect
ru: Отключить

# disconnectedUnexpectedly
source: Disconnected unexpectedly. Reason: {reason}
ru: Неожиданное отключение. Причина: {reason}

source: Quit
ru: Покидать

# iosAppRoutingNoSupport
source: App-based routing is currently not supported on iOS
ru: Маршрутизация на основе приложений в настоящее время не поддерживается на iOS.

# failedToChangeInboundMode
source: Failed to change inbound
ru: Не удалось изменить входящий

source: Language
ru: Язык

# mannual
source: Manual
ru: Руководство

source: Updated at
ru: Обновлено в

# min
source: {value} {value, plural, =0{Minutes} =1{Minute} other{Minutes}}
ru: {value} {value, plural, =0{Минуты} =1{Минута} other{Минуты}}

# hour
source: {value} {value, plural, =0{Hours} =1{Hour} other{Hours}}
ru: {value} {value, plural, =0{Часы} =1{Час} other{Часы}}

source: Privacy Policy
ru: политика конфиденциальности

source: Contact Us
ru: Связаться с нами

source: Open Source Software Notice
ru: Уведомление о программном обеспечении с открытым исходным кодом

source: Copy
ru: Копировать

# privacyPolicySummary
source: VX only collects diagnostic logs if the switch button below is on. These logs do not contain personal data. Please click the button below to view the detailed privacy policy.
ru: VX собирает журналы диагностики только при включенном переключателе ниже. Эти журналы не содержат персональных данных. Нажмите кнопку ниже, чтобы ознакомиться с подробной политикой конфиденциальности.

# diagnosticLogDoesNotContainPersonalData
source: Diagnostic logs does not link to you, and does not contain personal data
ru: Диагностические журналы не связаны с вами и не содержат персональных данных.

# shareDiagnosticLogWithDeveloper
source: Share diagnostic logs with developers
ru: Делитесь журналами диагностики с разработчиками

source: Yes
ru: Да

source: No
ru: Нет

# contactUsSummary
source: You can contact us by the following ways. Thank you!
ru: Вы можете связаться с нами следующими способами. Спасибо!

# contactUsFreely
source: If you have any questions, please contact us.
ru: Если у вас есть вопросы, пожалуйста, свяжитесь с нами.

# bugAreWelcome
source: Bug reports and suggestions are welcome, thanks very much!
ru: Сообщения об ошибках и предложения приветствуются, большое спасибо!

source: Copied to clipboard
ru: Скопировано в буфер обмена

# sourceCodeUrl
source: URL to source code
ru: URL к исходному коду

source: Email
ru: Электронная почта

source: Verification Code
ru: Проверочный код

source: Send
ru: Отправлять

source: Login
ru: Авторизоваться

# loginWithEmail
source: Email Login
ru: Вход по электронной почте

# loginWithApple
source: Apple
ru: Яблоко

# loginWithMicrosoft
source: Microsoft
ru: Майкрософт

# newUserTrialText
source: New users can try Pro for 7 days for free
ru: Новые пользователи могут попробовать Pro в течение 7 дней бесплатно.

# proExpiredAt
source: Pro Expiry
ru: Срок действия Pro

source: Lifetime Pro Account
ru: Пожизненная учетная запись Pro

source: Add Group
ru: Добавить группу

source: Delete Group
ru: Удалить группу

source: Group
ru: Группа

source: Add to Group
ru: Добавить в группу

source: Add App
ru: Добавить приложение

source: No selected node
ru: Узел не выбран

# pleaseSelectNode
source: Please select a node
ru: Пожалуйста, выберите узел

# pleaseSelectSelector
source: Please select a selector
ru: Пожалуйста, выберите селектор

source: Please enter rule name
ru: Пожалуйста, введите название правила

# ruleName
source: Matched Rule Name
ru: Имя соответствующего правила

source: Match All
ru: Совпадение всех

# ruleMatchCondition
source: When all conditions are met, the rule matches. If there are zero conditions, the rule will never match.
ru: Правило срабатывает, когда выполняются все условия. Если условий нет, правило не сработает никогда.

# inboundLabel
source: Inbound
ru: Входящий

source: Domain Set
ru: Набор доменов

source: App Set
ru: Набор приложений

source: IP Set
ru: Набор IP-адресов

source: Add Router Rule
ru: Добавить правило маршрутизатора

source: Add DNS Rule
ru: Добавить правило DNS

source: Edit Rule
ru: Редактировать правило

# addRouter
source: Add Route Mode
ru: Добавить режим маршрута

source: Copy Default
ru: Копировать по умолчанию

# ruleOrder
source: Rules are matched from top to bottom
ru: Правила сопоставляются сверху вниз

source: Node Chain
ru: Цепочка узлов

# nodeChainDesc
source: Nodes selected by this selector will form a node chain with the below nodes. The last node in the below list is the landing node. [Your Traffic] -> [Node(s) selected by the selector] -> [First node in the below list] -> ... -> [Last node in the below list] -> [Final destination]
ru: Выбранные узлы будут использовать следующие узлы в цепочке. Последний узел в цепочке является посадочным. Другими словами: [Ваш трафик] -> [Узлы, выбранные селектором] -> [Первый узел в списке ниже] -> ... -> [Последний узел в списке ниже] -> [Финальный пункт назначения]

source: Add Selector
ru: Добавить селектор

# selectorNameDuplicate
source: Selector name cannot be duplicated
ru: Имя селектора не может быть дублировано.

source: Rename Selector
ru: Переименовать селектор

source: All Nodes
ru: Все узлы

source: Partial Nodes
ru: Частичные узлы

source: Node Group
ru: Группа узлов

source: Lowest Latency
ru: Самая низкая задержка

source: Low Latency
ru: Низкая задержка

# highThroughput
source: High Speed
ru: Высокоскоростной

source: Name cannot be empty
ru: Имя не может быть пустым

# setNameDuplicate
source: Set name cannot be duplicated
ru: Имя набора не может быть дублировано.

source: Mutually Exclusive Set Name
ru: Взаимоисключающее имя набора

source: Include
ru: Включать

source: Exclude
ru: Исключать

source: Simple
ru: Простой

source: Advanced
ru: Передовой

source: Custom Direct
ru: Прямой заказ

source: Custom Proxy
ru: Пользовательский прокси

source: Private
ru: Частный

source: GFW (without custom direct)
ru: GFW (без прямого кастомного заказа)

source: GFW Mode Proxy Domains
ru: Прокси-домены режима GFW

source: GFW Mode Proxy IPs
ru: IP-адреса прокси-сервера режима GFW

source: CN Mode Proxy Domains
ru: Прокси-домены режима CN

source: CN Mode Direct Domains
ru: Прямые домены режима CN

source: CN Mode Direct IPs
ru: Прямые IP-адреса режима CN

source: Proxy-All Mode Proxy Domains
ru: Прокси-домены в режиме Proxy-All

source: Proxy-All Mode Direct Domains
ru: Прямые домены в режиме Proxy-All

source: Proxy-All Mode Direct IPs
ru: Прямые IP-адреса в режиме Proxy-All

source: RU-Block Mode Proxy Domains
ru: Прокси-домены в режиме RU-Block

source: RU-Block Mode Proxy IPs
ru: IP-адреса прокси-серверов в режиме RU-Block

source: RU-Block(All) Mode Proxy Domains
ru: Прокси-домены в режиме RU-Block(All)

source: RU-Block(All) Mode Proxy IPs
ru: IP-адреса прокси-серверов в режиме RU-Block(All)

# ipToDomain
source: IP -> Domain
ru: IP -> Домен

# proFeatureDescription
source: This is a Pro feature. Upgrade to Pro to unlock all features
ru: Это функция Pro. Перейдите на Pro, чтобы получить доступ ко всем функциям.

# becomePermanentPro
source: Become Permanent Pro User
ru: Станьте постоянным пользователем Pro

# becomePermanentProDescription
source: Become permanent Pro user
ru: Станьте постоянным пользователем Pro

source: Try Pro
ru: Попробуйте Pro

# newUserProTrial
source: New users can try Pro for 7 days
ru: Новые пользователи могут попробовать Pro в течение 7 дней

source: Purchase
ru: Покупка

source: Purchase Cancelled
ru: Покупка отменена

source: Verifying Purchase...
ru: Подтверждение покупки...

# purchaseVerificationFailed
source: Unable to verify purchase: {reason}
ru: Не удалось подтвердить покупку: {reason}

# ifYouHavePaid
source: If you have paid, don't worry, your payment will be automatically refunded by the store. If you have any questions, please contact us. Order ID: {orderId}
ru: Если вы оплатили заказ, не волнуйтесь: магазин автоматически вернёт вам деньги. Если у вас есть вопросы, свяжитесь с нами. Номер заказа: {orderId}

source: Invalid Purchase
ru: Недействительная покупка

source: Purchase Successful
ru: Покупка успешна

# purchaseFailed
source: Purchase failed: {status}
ru: Покупка не удалась: {status}

source: Unable to connect to store
ru: Невозможно подключиться к магазину

# loginBeforePurchase
source: Please login before purchasing. New users can try Pro for 7 days
ru: Пожалуйста, войдите в систему перед покупкой. Новые пользователи могут попробовать Pro-версию в течение 7 дней.

# loginBeforeRestore
source: Please login before restoring purchase.
ru: Пожалуйста, войдите в систему перед восстановлением покупки.

# upgradeToPermanentPro
source: Upgrade to Pro
ru: Обновление до Pro

source: Case Insensitive
ru: Без учета регистра

# startFailed
source: Failed to start
ru: Не удалось запустить

# startFailedWithReason
source: Failed to start: {reason}
ru: Не удалось запустить: {reason}

# startFailedReasonTunNeedAdmin
source: Tun inbound is only available when running as administrator. Rerun VX as administrator or change inbound mode.
ru: Входящий трафик Tun доступен только при запуске от имени администратора. Перезапустите VX от имени администратора или измените режим входящего трафика.

# startFailedReasonNoNode
source: No node
ru: Нет узла

# startFailedReasonNoEnabledNode
source: No enabled nodes, enable at least one node
ru: Нет включенных узлов, включите хотя бы один узел

# startFailedReasonNoSelected
source: No selected node
ru: Узел не выбран

# failedToUpdateSub
source: Failed to update subscription: {value}
ru: Не удалось обновить подписку: {value}

# failedToAddSubscription
source: Failed to add subscription, there is an existing subscription with the same link
ru: Не удалось добавить подписку, существует существующая подписка с такой же ссылкой.

# tunNeedAdmin
source: To use tun, rerun VX as administrator
ru: Чтобы использовать tun, перезапустите VX от имени администратора.

# decodeResult
source: Successfully got {value1} {value1, plural, =1{node} other{nodes}}, {value2} {value2, plural, =1{node failed} other{nodes failed}}
ru: Успешно получено {value1} {value1, plural, =1{узел} other{узлы}}, {value2} {value2, plural, =1{узел не удался} other{узлы вышли из строя}}

# updateSubResult
source: Successfully updated {value1} {value1, plural, =1{subscription} other{subscriptions}}, {value2} {value2, plural, =1{subscription} other{subscriptions}} failed. {value3} {value3, plural, =1{node} other{nodes}} added, {value4} {value4, plural, =1{node} other{nodes}} failed to parse
ru: Успешно обновлено {value1} {value1, plural, =1{подписка} other{подписки}}, {value2} {value2, plural, =1{подписка} other{подписки}} не удалось. Добавлено {value3} {value3, plural, =1{узел} other{узлы}}, не удалось проанализировать {value4} {value4, plural, =1{узел} other{узлы}}

# failedToUpdateCountry
source: Failed to update areas
ru: Не удалось обновить области

# keepAlivePeriodMustBeBetween2And60
source: Need to be between 2 and 60
ru: Возраст должен быть от 2 до 60 лет.

source: Show App
ru: Показать приложение

source: Hide App
ru: Скрыть приложение

source: Show System Apps
ru: Показать системные приложения

source: Hide System Apps
ru: Скрыть системные приложения

source: Double tap to delete
ru: Дважды нажмите, чтобы удалить

source: Method
ru: Метод

# sshKeyPath
source: SSH Key File Path
ru: Путь к файлу ключа SSH

# useCommonSshKey
source: Use Added SSH Key
ru: Использовать добавленный ключ SSH

# addCommonSshKey
source: Add SSH Key
ru: Добавить SSH-ключ

# sshKeyContentOrPathRequired
source: At least one of SSH Key Content or SSH Key File Path is required
ru: Требуется как минимум одно из следующего: содержимое ключа SSH или путь к файлу ключа SSH.

# failedToAddCommonSshKey
source: Failed to add SSH key
ru: Не удалось добавить ключ SSH.

# failedToAddCommonSshKeyDueToDuplicateName
source: Failed to add SSH key because there is a key with the same name
ru: Не удалось добавить ключ SSH, так как существует ключ с таким же именем.

source: Quick Deploy
ru: Быстрое развертывание

source: Deploy
ru: Развертывать

source: Close
ru: Закрывать

# deploySuccess
source: {deploy} on Server-{server} succeeded
ru: {deploy} на сервере-{server} успешно выполнено

# failedToDeploy
source: Failed to deploy: {value}
ru: Не удалось развернуть: {value}

# serverCA
source: Root CA
ru: Корневой центр сертификации

# failedToInitGrpcClient
source: Failed to init grpc client: {value}
ru: Не удалось инициализировать клиент grpc: {value}

source: Block
ru: Блокировать

source: Failure
ru: Отказ

source: App Keyword
ru: Ключевое слово приложения

source: Sniff Domain
ru: Домен Sniff

source: Traffic Stats
ru: Статистика трафика

source: Use SSH Key
ru: Использовать SSH-ключ

source: Error Only
ru: Только ошибка

source: All
ru: Все

# failedToUndoBlockDns
source: Failed to remove the WFP filter for blocking dns traffic of primary NIC, please close this app which can remove the filter
ru: Не удалось удалить фильтр WFP для блокировки DNS-трафика основной сетевой карты. Закройте это приложение, которое может удалить фильтр.

# failedToRemoveSystemProxy
source: Failed to remove system proxy, please remove it mannually at Settings > System Proxy.
ru: Не удалось удалить системный прокси-сервер. Пожалуйста, удалите его вручную в разделе «Настройки» > «Системный прокси-сервер».

# failedToChangeNode
source: Failed to change node: {value}
ru: Не удалось изменить узел: {value}

source: Failure detail
ru: Подробности отказа

source: Failed nodes
ru: Неисправные узлы

# failedSub
source: Failed subscriptions
ru: Неудачные подписки

# addRemark
source: Add a remark?
ru: Добавить замечание?

source: Multi Select
ru: Множественный выбор

source: Share
ru: Делиться

source: Quick Action
ru: Быстрое действие

# deleteUnusable
source: Delete Unusable Nodes
ru: Удалить неиспользуемые узлы

source: Small Screen Preference
ru: Настройки малого экрана

source: Chain Proxy
ru: Цепной прокси

source: Single Node
ru: Одиночный узел

source: Multiple Nodes
ru: Несколько узлов

source: Balance Strategy
ru: Стратегия баланса

# manualNodeMode
source: Manual Mode
ru: Ручной режим

# outboundMode
source: Outbound
ru: Исходящий

source: Random
ru: Случайный

source: Mode
ru: Режим

# balanceStrategyMemory
source: Memory
ru: Память

# selectingStrategy
source: Select Strategy
ru: Выберите стратегию

# mostThroughput
source: Speed Highest
ru: Скорость самая высокая

# allOk
source: Usable
ru: Годен к использованию

source: Your Devices
ru: Ваши устройства

source: Destination
ru: Место назначения

source: Add New Node
ru: Добавить новый узел

source: Use Existing Node
ru: Использовать существующий узел

# atLeastTwoNodes
source: At least two nodes are required
ru: Требуется не менее двух узлов.

# advancedMode
source: Pro Mode
ru: Профессиональный режим

source: Simple Mode
ru: Простой режим

source: Rule
ru: Правило

source: Set
ru: Набор

source: Selector
ru: Селектор

# atmoicDomainSet
source: Small Domain Set
ru: Малый набор доменов

# greatDomainSet
source: Large Domain Set
ru: Большой набор доменов

# atmoicIpSet
source: Small IP Set
ru: Малый набор IP-адресов

# greatIpSet
source: Large IP Set
ru: Большой набор IP-адресов

source: Create Great Domain Set
ru: Создайте отличный набор доменов

source: Edit Great Domain Set
ru: Редактировать большой набор доменов

source: Create Small Domain Set
ru: Создать небольшой набор доменов

source: Edit Small Domain Set
ru: Редактировать небольшой набор доменов

source: Edit Great IP Set
ru: Редактировать отличный набор IP-адресов

source: Create Great IP Set
ru: Создайте отличный набор IP-адресов

source: Edit App Set
ru: Редактировать набор приложений

source: Condition
ru: Состояние

source: Range
ru: Диапазон

source: Account
ru: Счет

source: Logout
ru: Выйти

# geoSiteOrGeoIPFileNotFound
source: Downloading needed geo files...
ru: Загрузка необходимых геофайлов...

source: Create IP Small Set
ru: Создать небольшой набор IP-адресов

source: Edit IP Small Set
ru: Редактировать IP-адрес малого набора

source: Delete failed
ru: Удаление не удалось

source: Delete Account
ru: Удалить аккаунт

# deleteAccountConfirm
source: Are you sure you want to delete your account? This action cannot be undone.
ru: Вы уверены, что хотите удалить свою учётную запись? Это действие не может быть отменено.

# domainSetDescription
source: The following domain set uses proxy DNS server (default 8.8.8.8 and 1.1.1.1) to resolve, other domains use direct DNS server (default is dns servers of your primary physical nic, or 223.5.5.5 and 114.114.114.114 if the former cannot be known) to resolve
ru: Следующий набор доменов использует прокси-DNS-сервер (по умолчанию 8.8.8.8 и 1.1.1.1) для разрешения, другие домены используют прямой DNS-сервер (по умолчанию это DNS-серверы вашей основной физической сетевой карты или 223.5.5.5 и 114.114.114.114, если первый неизвестен) для разрешения

# routerRuleDescription
source: For each connection, rules are matched one by one from top to bottom, if a rule matches, the following rules will not be considered. If no rule matches, the connection will abort.
ru: Для каждого соединения правила сопоставляются одно за другим сверху вниз. Если одно правило совпало, последующие правила не учитываются. Если ни одно правило не совпало, соединение прерывается.

# dstIpSet
source: Destination IP Set
ru: Набор IP-адресов назначения

# ruleNameVXTestNodes
source: VX Node Testing
ru: Тестирование узла VX

# ruleNameInternalDnsProxyGoProxy
source: Internal DNS (CF)
ru: Внутренний DNS (CF)

# ruleNameInternalDnsDirectGoDirect
source: Internal DNS (Aliyun & CF)
ru: Внутренний DNS (Aliyun и CF)

# ruleNameProxyDnsServerGoProxy
source: Default Proxy DNS Server
ru: Прокси-DNS-сервер по умолчанию

# ruleNameDirectDnsServerGoDirect
source: Default Direct DNS Server
ru: Прямой DNS-сервер по умолчанию

# ruleNameDnsHijack
source: DNS Hijack: Non-Direct Domain
ru: Перехват DNS: непрямой домен

# ruleNameCustomDirectDomain
source: Custom Direct Domain
ru: Пользовательский прямой домен

# ruleNameCustomDirectIp
source: Custom Direct IP
ru: Пользовательский прямой IP

# ruleNameCustomProxyDomain
source: Custom Proxy Domain
ru: Пользовательский прокси-домен

# ruleNameCustomProxyIp
source: Custom Proxy IP
ru: Пользовательский прокси-IP
